Repository: DgharMohamed/IslamHome-App-distribution
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Islam Home
ar: المكتبة الإسلامية

source: Good Morning
ar: صباح الخير

source: Good Afternoon
ar: مساء الخير

source: Good Night
ar: ليلة سعيدة

source: Prayer Times
ar: مواقيت الصلاة

source: Daily Verse
ar: آية اليوم

source: Khatma Progress
ar: متابعة الختمة

# reachedSurah
source: Reached Surah {surah}
ar: وصلت إلى سورة {surah}

source: Explore Sections
ar: استكشف الأقسام

# quranMushaf
source: Holy Quran
ar: المصحف الشريف

# propheticHadith
source: Prophetic Hadiths
ar: الأحاديث النبوية

source: Hadith of the Day
ar: حديث اليوم

# azkarDuas
source: Azkar and Duas
ar: الأذكار والأدعية

# adhkarOfTheDay
source: Daily Adhkar
ar: أذكار المسلم

source: Radio & Live
ar: الإذاعات والمباشر

source: Favorite Reciters
ar: قراؤك المفضلون

source: View All
ar: عرض الكل

source: Settings
ar: الإعدادات

source: Notifications & Athan
ar: التنبيهات والآذان

source: Athan Notifications
ar: تنبيهات الآذان

# enabledForAll
source: Enabled for all prayers
ar: مفعلة لكافة الصلوات

source: Disabled
ar: معطلة

source: Appearance & Language
ar: المظهر واللغة

source: Dark Mode
ar: المظهر الداكن

# darkModeSubtitle
source: Always enabled for eye comfort
ar: مفعل دائماً للراحة البصرية

source: App Language
ar: لغة التطبيق

source: Arabic
ar: العربية

source: About App
ar: عن التطبيق

source: App Version
ar: إصدار التطبيق

source: Share App
ar: شارك التطبيق

source: Rate App
ar: قيم التطبيق

source: Select Language
ar: اختر اللغة

source: English
ar: الإنجليزية

source: Global Search
ar: بحث شامل

# searchSurah
source: Search for surah...
ar: بحث عن سورة...

source: Download All
ar: تحميل الكل

source: Favorites
ar: المفضلة

source: Downloads
ar: التنزيلات

source: Quran Text
ar: نص القرآن

source: Tasbeeh
ar: التسبيح

source: Live TV
ar: البث المباشر

source: Books
ar: المكتبة المقروءة

source: Next Prayer
ar: الصلاة القادمة

source: Current Location
ar: الموقع الحالي

source: Qibla
ar: القبلة

source: Fajr
ar: الفجر

source: Dhuhr
ar: الظهر

source: Asr
ar: العصر

source: Maghrib
ar: المغرب

source: Isha
ar: العشاء

source: No bookmark saved
ar: لا توجد علامة مرجعية محفوظة

source: Hadith Books
ar: كتب الحديث

source: Nine Books of Sunnah
ar: تسع كتب من أصول السنة

# hadithCount
source: {count} Hadith
ar: {count} حديث

# page
source: Page {number}
ar: صفحة {number}

# noHadithsAvailableOffline
source: No hadiths available offline for this book. Please connect to the internet to download.
ar: لا توجد أحاديث متاحة أوفلاين لهذا الكتاب. يرجى الاتصال بالإنترنت للتحميل.

source: Azkar
ar: الأذكار

source: Duas
ar: الأدعية

source: Selected Duas
ar: أدعية مختارة

source: Daily Muslim Azkar
ar: أذكار المسلم اليومية

source: Morning Azkar
ar: أذكار الصباح

source: Evening Azkar
ar: أذكار المساء

# sleepAzkar
source: Sleep Adhkar
ar: أذكار النوم

source: Wake up Azkar
ar: أذكار الاستيقاظ

source: Mosque Azkar
ar: أذكار المسجد

source: Adhan Azkar
ar: أذكار الآذان

source: Wudu Azkar
ar: أذكار الوضوء

source: Prophetic Duas
ar: أدعية نبوية

source: Quran Duas
ar: أدعية قرآنية

source: Prophets Duas
ar: أدعية الأنبياء

source: Miscellaneous Azkar
ar: أذكار متنوعة

source: Done
ar: تم

# startingDownloadAll
source: Starting to download all surahs...
ar: بدأ تحميل جميع السور...

# downloadCompleted
source: Completed downloading {count} surahs
ar: تم اكتمال تحميل {count} سورة

# surahNumber
source: Surah No. {number}
ar: سورة رقم {number}

# recitationOf
source: Recitation of {name}
ar: تلاوة {name}

source: Download successful
ar: تم التحميل بنجاح

# downloadFailed
source: Download failed: {error}
ar: فشل التحميل: {error}

source: Electronic Tasbeeh
ar: مسبحة إلكترونية

# totalTasbeehs
source: Total: {count}
ar: إجمالي التسبيحات

source: Tap to count
ar: اضغط في أي مكان في الدائرة للتسبيح

source: Reset
ar: إعادة تعيين

source: History
ar: السجل

# mushaf
source: Holy Mushaf
ar: المصحف الشريف

# pageSavedAsBookmark
source: Page {page} saved as bookmark
ar: تم حفظ الصفحة {page} كعلامة مرجعية

# readingModeText
source: Text Reading Mode
ar: وضع القراءة النصي

# pageXOf604
source: Page {page} of 604
ar: صفحة {page} من 604

# lastReadMushaf
source: Last Read (Page {page})
ar: آخر قرائة (صفحة {page})

source: Previous
ar: السابقة

source: Index
ar: الفهرس

source: Next
ar: التالية

source: Error loading page
ar: حدث خطأ في تحميل الصفحة

source: Surah Index
ar: فهرس السور

source: Error loading surahs
ar: حدث خطأ في تحميل السور

source: Meccan
ar: مكية

source: Medinan
ar: مدنية

# ayahsCount
source: {count} Ayahs
ar: {count} آية

# pageN
source: Page {page}
ar: صفحة {page}

source: Show Mushaf
ar: عرض المصحف

source: Select Translation
ar: اختر الترجمة

source: Select Tafsir
ar: اختر التفسير

source: Choose Translation
ar: اختر الترجمة

source: Choose Tafsir
ar: اختر التفسير

source: Choose Surah
ar: اختر السورة

# verseN
source: Verse {number}
ar: الآية {number}

# noTafsirAvailable
source: No tafsir available currently
ar: لا يوجد تفسير متاح حالياً

source: Radio
ar: الإذاعات

# videos
source: Prophetic Biography
ar: السيرة النبوية

source: My Account
ar: حسابي

# moodAnxious
source: Anxious
ar: قلق

# moodSad
source: Sad
ar: حزين

# moodHappy
source: Happy
ar: سعيد

# moodLost
source: Lost
ar: تائه

# moodTired
source: Tired
ar: متعب

# surahSharh
source: Surah Ash-Sharh
ar: سورة الشرح

# descAnxious
source: Remember that with hardship comes ease. This surah brings peace to anxious hearts.
ar: تذكر دائماً أن مع العسر يسراً، هذه السورة تبعث الطمأنينة في القلوب القلقة.

# actionReadSurah
source: Read Surah
ar: اقرأ السورة

source: Surah Yusuf
ar: سورة يوسف

# descSad
source: A story of patience and relief after hardship. A balm for sad hearts.
ar: قصة الصبر والفرج بعد الضيق. إنها بلسم للقلوب الحزينة.

# surahRahman
source: Surah Ar-Rahman
ar: سورة الرحمن

# descHappy
source: The best way to thank Allah for His blessings. Which of your Lord's favors will you deny?
ar: خير ما يشكر به الله على نعمه وفضله. فبأي آلاء ربكما تكذبان.

# surahFatiha
source: Surah Al-Fatiha
ar: سورة الفاتحة

# descLost
source: The Mother of the Book and a prayer for guidance to the straight path.
ar: أم الكتاب والدعاء بالهداية للصراط المستقيم في كل حين.

# descTired
source: Rest your soul and calm your mind with the remembrance of Allah before sleep.
ar: لتستريح نفسك ويهدأ بالك بذكر الله قبل المنام.

# actionGoToAzkar
source: Go to Adhkar
ar: اذهب للأذكار

# becauseYouFeel
source: Because you feel {mood}
ar: لأنك تشعر بـ {mood}

# howDoYouFeel
source: How do you feel right now?
ar: بماذا تشعر الآن؟

# unknownName
source: Unknown
ar: اسم غير معروف

# mushafCount
source: {count} Surah
ar: {count} مصحف

source: Now Playing...
ar: جاري التشغيل...

# reciterLabel
source: Reciter
ar: القارئ

source: Verse of the Day
ar: آية اليوم

# dailyVerseText
source: Indeed, with hardship comes ease * Indeed, with hardship comes ease
ar: فَإِنَّ مَعَ الْعُسْرِ يُسْرًا * إِنَّ مَعَ الْعُسْرِ يُسْرًا

# prayerTimesTitle
source: Prayer Times
ar: مواقيت الصلاة

# noPrayerTimesFound
source: No prayer times found for these inputs
ar: لم يتم العثور على مواقيت لهذه المدخلات

# cityLabel
source: City
ar: المدينة

# countryLabel
source: Country
ar: الدولة

# updateTimesButton
source: Update Times
ar: تحديث المواقيت

# errorOccurred
source: Error occurred: {error}
ar: حدث خطأ: {error}

source: Sunrise
ar: الشروق

source: Now Listening
ar: جاري الاستماع

source: Sleep Timer
ar: مؤقت النوم

source: Share
ar: مشاركة

# comingSoon
source: {feature} will be enabled soon
ar: سيتم تفعيل {feature} قريباً

source: Starting download...
ar: جاري بدء التحميل...

source: Download
ar: تحميل

source: Playlist
ar: القائمة

source: Current Playlist
ar: قائمة التشغيل الحالية

# audioCount
source: {count} audios
ar: {count} صوتيات

# nowPlayingLabel
source: Now Playing
ar: يعمل الآن

# timeRemaining
source: Time remaining: {time}
ar: الوقت المتبقي: {time}

source: Stop Timer
ar: إيقاف المؤقت

source: Sleep timer stopped
ar: تم إيقاف مؤقت النوم

# timerSetFor
source: Timer set for {time}
ar: تم ضبط المؤقت لـ {time}

# surahIdNotFound
source: Surah identifier not found
ar: لم يتم العثور على معرف السورة

source: Error loading text
ar: خطأ في تحميل النص

# shareRecitationText
source: Listen to {title} by {reciter} via Islamic Library App. {link}
ar: استمع إلى {title} بصوت القارئ {reciter} عبر تطبيق المكتبة الإسلامية. {link}

# minutes
source: {count} minutes
ar: {count} دقيقة

# liveTvTitle
source: Live TV
ar: البث المباشر

# religiousChannelsDescription
source: Religious channels 24/7
ar: قنوات دينية على مدار الساعة

# videoPlayerError
source: Unable to play video
ar: تعذر تشغيل الفيديو

# checkInternetConnection
source: Please check your internet connection and try again
ar: يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى

source: Retry
ar: إعادة المحاولة

# islamicRadioTitle
source: Islamic Radio
ar: الإذاعات الإسلامية

# liveRadioDescription
source: Live broadcast 24/7
ar: بث مباشر على مدار الساعة

# searchRadioHint
source: Search for station...
ar: ابحث عن إذاعة...

# videoLibraryTitle
source: Prophetic Biography
ar: السيرة النبوية

# searchVideoHint
source: Search biography...
ar: ابحث في السيرة النبوية...

source: All
ar: الكل

# favoritesTitle
source: Favorites
ar: المفضلة

source: Reciters
ar: القراء

source: Surahs
ar: السور

source: No favorite reciters
ar: لا يوجد قراء في المفضلة

source: No favorite surahs
ar: لا توجد سور في المفضلة

# unknownReciter
source: Unknown
ar: غير معروف

source: Downloading {surah}...
ar: جاري تحميل سورة {surah}...

source: Downloaded
ar: تم التحميل

# downloadsTitle
source: Downloads
ar: التنزيلات

source: Downloaded Surahs
ar: السور المحملة

# downloadedLibraryDescription
source: Your downloaded audio library
ar: مكتبتك الصوتية المحملة

# libraryEmpty
source: Library is empty
ar: المكتبة فارغة

source: Downloaded files will appear here
ar: الملفات المحملة ستظهر هنا

# downloadedSurahCount
source: {count} downloaded
ar: {count} سورة محملة

source: Audio File
ar: ملف صوتي

# deleteFileQuestion
source: Delete File?
ar: حذف الملف؟

# deleteFileConfirmation
source: Are you sure you want to permanently delete this file?
ar: هل أنت متأكد من حذف هذا الملف نهائياً؟

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

# booksLibraryTitle
source: Books Library
ar: مكتبة الكتب

# articlesAndBooksTitle
source: Articles & Books
ar: المقالات والكتب

# searchLibraryHint
source: Search library...
ar: ابحث في المكتبة...

# booksLabel
source: Books
ar: كتب

# articlesLabel
source: Articles
ar: مقالات

# audiosLabel
source: Audio
ar: صوتيات

source: No search results
ar: لا توجد نتائج بحث

# downloadButton
source: Download
ar: تحميل

# pageCount
source: Page {page}
ar: صفحة {page}

# allRecitersTitle
source: All Reciters
ar: جميع القراء

source: Main Menu
ar: القائمة الرئيسية

source: Reading & Media
ar: محتوى القراءة

source: Utilities & Tools
ar: الأدوات المساعدة

# appNameArabic
source: Bait Al-Islam
ar: بيت الإسلام

source: Home
ar: الرئيسية

source: Hadith
ar: الحديث

# useLocation
source: Use Current Location
ar: استخدام الموقع الحالي

# locationServicesDisabled
source: Location services are disabled.
ar: خدمات الموقع معطلة.

# locationPermissionsDenied
source: Location permissions are denied.
ar: تم رفض إذن الوصول للموقع.

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied, we cannot request permissions.
ar: تم رفض إذن الموقع بشكل دائم.

# failedToGetLocation
source: Failed to get location: {error}
ar: فشل في الحصول على الموقع: {error}

source: Update Location
ar: تحديث الموقع

# surahDuha
source: Surah Ad-Duha
ar: سورة الضحى

# descDuha
source: Your Lord has not forsaken you. A divine message for every heart feeling distressed.
ar: ما ودعك ربك وما قلى. رسالة ربانية لكل قلب يشعر بالضيق والحزن.

# actionGoToDua
source: Go to Supplications
ar: اذهب للأدعية

source: Start Tasbeeh
ar: ابدأ التسبيح

# rememberAllah
source: Remembrance of Allah
ar: ذكر الله

# descHappyDhikr
source: Praising Allah increases blessings and sustains happiness.
ar: الحمد لله تزيد النعمة وتبارك في الرزق وتديم السعادة.

source: Allah is Near
ar: الله قريب منك

# descLostDhikr
source: Allah is always close to you, guiding you and hearing your prayers if you lose your way.
ar: الله قريب منك دائماً، يوجهك ويسمع دعاءك إذا ضللت الطريق.

# rewardForTired
source: Reward for Tiredness
ar: أجر التعب

# descTiredDhikr
source: Remember that your tiredness is rewarded, and Allah does not burden a soul beyond its capacity.
ar: تذكر أن تعبك مأجور، وأن الله لا يحملك فوق طاقتك. استرح بذكر الله.

# searchHint
source: Search Quran, Hadith, Adhkar...
ar: ابحث في القرآن، الحديث، الأذكار...

# searchQuranSubtitle
source: Quran: {surah} ({ayah})
ar: القرآن: {surah} ({ayah})

# searchHadithSubtitle
source: Hadith: {book} - {chapter}
ar: الحديث: {book} - {chapter}

# searchAdhkarSubtitle
source: Adhkar: {category}
ar: الأذكار: {category}

# exploreLibrary
source: Explore the Library
ar: استكشف المكتبة

# searchDescription
source: Search for verses, hadiths, and prayers
ar: ابحث عن الآيات والأحاديث والأدعية

# khatmaPlannerTitle
source: Smart Khatma Planner
ar: مخطط الختمة الذكي

# khatmaPlannerSubtitle
source: Specify the duration to complete the Quran
ar: حدد المدة التي ترغب بختم القرآن فيها

source: Start Khatma
ar: ابدأ الختمة

source: Days
ar: يوم

source: Pages daily
ar: صفحات يومياً

source: Pages per prayer
ar: صفحات لكل صلاة

# remainingToday
source: {count} pages remaining today
ar: المتبقي لك اليوم: {count} صفحات

# onTrack
source: You are on track
ar: أنت على الجدول

source: Setup Plan
ar: ضبط الخطة

source: Cancel Plan
ar: إلغاء الخطة

source: Manage Notification Settings
ar: إدارة إعدادات الإشعارات

# manageNotificationSettingsSubtitle
source: Open system settings for notifications
ar: فتح إعدادات النظام للإشعارات

source: Continue Your Khatma
ar: واصل ختمـتك

# juzAndSurah
source: Juz {juz} - {surah}
ar: الجزء {juz} - {surah}

# smartSuggestionsForNewPlan
source: Smart suggestions for your new plan:
ar: اقتراحات ذكية لنظامك الجديد:

# khatmaInMonth
source: Khatma in a month
ar: ختمة في شهر

# oneJuzDaily
source: 1 Juz daily
ar: 1 جزء يومياً

source: Khatma in two months
ar: ختمة في شهرين

# fifteenPagesDaily
source: 15 pages daily
ar: 15 صفحة يومياً

# pagesRemainingToday
source: {count} pages remaining today
ar: بقي لك {count} صفحات لليوم

source: Khatma History
ar: سجل الختمات

source: Khatma Settings
ar: إعدادات الختمة

# duaKhatm
source: Dua for Completing Quran
ar: دعاء ختم القرآن

source: Continue Reading
ar: إكمال القراءة
